@joerayme did you do anything in the `project`? If 

```
  + resource "google_bigquery_dataset_iam_member" "service_account" {
      + dataset_id = "test_dataset"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ember     = (known after apply)
      + project    = (known after apply)
      + role       = "roles/bigquery.dataOwner"
    }
```